# Ex1 - Filtering and Sorting Data



### Step 1. Import the necessary libraries

In [104]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv) and assign it to a variable called chipo.

In [105]:
chipo = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv', on_bad_lines='skip', sep='\t')

### Step 3. Name of the max valued product

In [106]:
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [5]:
chipo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [6]:
chipo.describe()

          order_id     quantity
count  4622.000000  4622.000000
mean    927.254868     1.075725
std     528.890796     0.410186
min       1.000000     1.000000
25%     477.250000     1.000000
50%     926.000000     1.000000
75%    1393.000000     1.000000
max    1834.000000    15.000000

In [8]:
chipo['item_price'].max()

'$9.39 '

In [12]:
chipo['item_price'].sort_values(ascending= False).head(20)

2624    $9.39
4419    $9.39
4036    $9.39
1825    $9.39
3115    $9.39
4547    $9.39
3098    $9.39
4241    $9.39
1418    $9.39
4391    $9.39
4572    $9.39
2600    $9.39
607     $9.39
4390    $9.39
1865    $9.39
1421    $9.39
3356    $9.39
1789    $9.25
1771    $9.25
418     $9.25
Name: item_price, dtype: object

In [13]:
chipo[['item_name', 'item_price']][chipo['item_price'] == chipo['item_price'].max()]

                item_name item_price
607      Steak Salad Bowl     $9.39
1418  Barbacoa Salad Bowl     $9.39
1421  Barbacoa Salad Bowl     $9.39
1825  Barbacoa Salad Bowl     $9.39
1865  Carnitas Salad Bowl     $9.39
2600     Steak Salad Bowl     $9.39
2624     Steak Salad Bowl     $9.39
3098     Steak Salad Bowl     $9.39
3115  Carnitas Salad Bowl     $9.39
3356  Barbacoa Salad Bowl     $9.39
4036     Steak Salad Bowl     $9.39
4241     Steak Salad Bowl     $9.39
4390  Barbacoa Salad Bowl     $9.39
4391     Steak Salad Bowl     $9.39
4419     Steak Salad Bowl     $9.39
4547     Steak Salad Bowl     $9.39
4572     Steak Salad Bowl     $9.39

In [15]:
chipo['item_price'].sort_values(ascending= False)

2624    $9.39
4419    $9.39
4036    $9.39
1825    $9.39
3115    $9.39
         ...
3145    $1.09
414     $1.09
3162    $1.09
821     $1.09
1457    $1.09
Name: item_price, Length: 4622, dtype: object

In [ ]:
# chipo['item_price'] = pd.to_numeric(chipo['item_price'], )

In [19]:
chipo['item_price'].apply(lambda x: x.replace("$", ""))

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
         ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: object

In [20]:
chipo['item_price'].str.replace("$", "")

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
         ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: object

In [108]:
chipo['item_price'] = chipo['item_price'].str[1::].astype(float)

In [27]:
chipo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 180.7+ KB

In [109]:
chipo['item_price'].max()

44.25

In [29]:
chipo[['item_name', 'item_price', 'quantity']][chipo['item_price'] == chipo['item_price'].max()]

                         item_name  item_price  quantity
3598  Chips and Fresh Tomato Salsa       44.25        15

In [38]:
chipo[['item_name', 'item_price']][chipo['quantity']  == 1].sort_values(by= 'item_price', ascending= False)

                item_name  item_price
606      Steak Salad Bowl       11.89
3208  Barbacoa Salad Bowl       11.89
2957     Steak Salad Bowl       11.89
2401     Steak Salad Bowl       11.89
4313     Steak Salad Bowl       11.89
...                   ...         ...
1945          Canned Soda        1.09
2850          Canned Soda        1.09
3683          Canned Soda        1.09
261           Canned Soda        1.09
3221          Canned Soda        1.09

[4355 rows x 2 columns]

In [111]:
chipo['unit_price'] = chipo['item_price'] / chipo['quantity']

In [52]:
chipo[['unit_price', 'item_price', 'item_name']][chipo['unit_price'] == \
        chipo['unit_price'].max()].drop_duplicates('item_name')['item_name'].values

array(['Steak Salad Bowl', 'Carnitas Salad Bowl', 'Barbacoa Salad Bowl'],
      dtype=object)

### Step 4. How many products cost more than $10.00?

In [68]:
chipo['item_name'][chipo['unit_price'] > 10].unique()

array(['Chicken Bowl', 'Steak Burrito', 'Chicken Burrito',
       'Barbacoa Bowl', 'Veggie Burrito', 'Veggie Bowl',
       'Chicken Soft Tacos', 'Steak Bowl', 'Carnitas Burrito',
       'Carnitas Bowl', 'Barbacoa Burrito', 'Chicken Salad Bowl',
       'Barbacoa Crispy Tacos', 'Veggie Salad Bowl', 'Chicken Salad',
       'Steak Salad Bowl', 'Chicken Crispy Tacos', 'Veggie Soft Tacos',
       'Barbacoa Soft Tacos', 'Carnitas Crispy Tacos',
       'Carnitas Salad Bowl', 'Barbacoa Salad Bowl', 'Steak Soft Tacos',
       'Carnitas Soft Tacos', 'Steak Crispy Tacos'], dtype=object)

Extra: Cuántos pedidos se han hecho con un producto de más de 10$

In [69]:
chipo.head()

,order_id,quantity,item_name,choice_description,item_price,unit_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,8.49

In [76]:
chipo[['order_id', 'unit_price']][chipo['unit_price'] > 10].drop_duplicates('order_id')

      order_id  unit_price
5            3       10.98
7            4       11.75
13           7       11.25
23          12       10.98
39          19       11.75
...        ...         ...
4589      1825       11.25
4607      1829       11.75
4610      1830       11.75
4617      1833       11.75
4619      1834       11.25

[787 rows x 2 columns]

### Step 5. What is the price of each item? Get only item_name and unit_price

In [78]:
chipo[['item_price', 'unit_price']]

      item_price  unit_price
0           2.39        2.39
1           3.39        3.39
2           3.39        3.39
3           2.39        2.39
4          16.98        8.49
...          ...         ...
4617       11.75       11.75
4618       11.75       11.75
4619       11.25       11.25
4620        8.75        8.75
4621        8.75        8.75

[4622 rows x 2 columns]

### Step 6. Sort by the name of the item

In [79]:
chipo.sort_values(by= 'item_name')

,order_id,quantity,item_name,choice_description,item_price,unit_price
3389,1360,2,6 Pack Soft Drink,[Diet Coke],12.98,6.49
341,148,1,6 Pack Soft Drink,[Diet Coke],6.49,6.49
1849,749,1,6 Pack Soft Drink,[Coke],6.49,6.49
1860,754,1,6 Pack Soft Drink,[Diet Coke],6.49,6.49
2713,1076,1,6 Pack Soft Drink,[Coke],6.49,6.49
...,...,...,...,...,...,...
2384,948,1,Veggie Soft Tacos,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",8.75,8.75
781,322,1,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Black Beans, Cheese, Sou...",8.75,8.75
2851,1132,1,Veggie Soft Tacos,"[Roasted Chili Corn Salsa (Medium), [Black Bea...",8.49,8.49
1699,688,1,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.25,11.25
1395,567,1,Veggie Soft Tacos,"[Fresh Tomato Salsa (Mild), [Pinto Beans, Rice...",8.49,8.49

### Step 7. What was the quantity of the most expensive item ordered? 2 ways

In [84]:
chipo.loc[3598]

order_id                                      1443
quantity                                        15
item_name             Chips and Fresh Tomato Salsa
choice_description                             NaN
item_price                                   44.25
unit_price                                    2.95
Name: 3598, dtype: object

In [114]:
chipo.loc[chipo['item_price'].idxmax()]['quantity']

15

In [116]:
chipo['quantity'][chipo['item_price'] == chipo['item_price'].max()].values

array([15], dtype=int64)

### Step 8. How many times was a Veggie Salad Bowl ordered?

In [122]:
chipo[chipo['item_name'] == "Veggie Salad Bowl"]['quantity'].sum()

18

In [124]:
chipo["item_name"].value_counts().loc['Veggie Salad Bowl']

18

In [125]:
num_ordenes = chipo["item_name"].value_counts()
num_ordenes

veggie_salad_bowl = num_ordenes.loc["Veggie Salad Bowl"]
print(f"El Veggie Salad Bowl se pidio {veggie_salad_bowl} veces.")

El Veggie Salad Bowl se pidio 18 veces.

In [127]:
chipo[chipo['item_name'].str.contains("Veggie Salad B")]

,order_id,quantity,item_name,choice_description,item_price,unit_price
186,83,1,Veggie Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.25,11.25
295,128,1,Veggie Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",11.25,11.25
455,195,1,Veggie Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.25,11.25
496,207,1,Veggie Salad Bowl,"[Fresh Tomato Salsa, [Rice, Lettuce, Guacamole...",11.25,11.25
960,394,1,Veggie Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",8.75,8.75
1316,536,1,Veggie Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",8.75,8.75
1884,760,1,Veggie Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.25,11.25
2156,869,1,Veggie Salad Bowl,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",11.25,11.25
2223,896,1,Veggie Salad Bowl,"[Roasted Chili Corn Salsa, Fajita Vegetables]",8.75,8.75
2269,913,1,Veggie Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",8.75,8.75
2683,1066,1,Veggie Salad Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",8.75,8.75
3223,1289,1,Veggie Salad Bowl,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",11.25,11.25
3293,1321,1,Veggie Salad Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",8.75,8.75
4109,1646,1,Veggie Salad Bowl,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",11.25,11.25
4201,1677,1,Veggie Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Black...",11.25,11.25
4261,1700,1,Veggie Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.25,11.25
4541,1805,1,Veggie Salad Bowl,"[Tomatillo Green Chili Salsa, [Fajita Vegetabl...",8.75,8.75
4573,1818,1,Veggie Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",8.75,8.75

### Step 9. How many times did someone order more than one Canned Soda?

In [128]:
chipo[['order_id', 'item_name', 'quantity']][(chipo['item_name'] == "Canned Soda") & \
                (chipo['quantity'] > 1)].drop_duplicates('order_id')

      order_id    item_name  quantity
18           9  Canned Soda         2
51          23  Canned Soda         2
162         73  Canned Soda         2
171         76  Canned Soda         2
350        150  Canned Soda         2
352        151  Canned Soda         2
698        287  Canned Soda         2
700        288  Canned Soda         2
909        376  Canned Soda         2
1091       450  Canned Soda         2
1944       787  Canned Soda         2
2135       859  Canned Soda         2
2235       901  Canned Soda         4
2905      1156  Canned Soda         2
3152      1258  Canned Soda         2
3364      1349  Canned Soda         2
3592      1440  Canned Soda         2
3866      1550  Canned Soda         2